{"1": 2159, "3": 13, "7": 15, "15": 5, "514": 1, "20": 16, "13": 30, "29": 11, "36": 13, "18": 14, "520": 4, "39": 18, "11": 8, "523": 4, "47": 4, "525": 2, "528": 2, "48": 1, "513": 2, "50": 12, "529": 29, "53": 12, "546": 10, "56": 1, "548": 16, "60": 2, "62": 2, "554": 18, "58": 4, "558": 26, "64": 2, "562": 52, "65": 1, "539": 11, "66": 1, "569": 1, "68": 2, "571": 1, "73": 7, "573": 11, "49": 3, "584": 1, "83": 3, "88": 4, "586": 1, "46": 3, "588": 9, "97": 18, "98": 1, "99": 1, "100": 1, "8": 2, "101": 1, "592": 8, "102": 2, "41": 8, "76": 16, "103": 1, "2": 3, "105": 3, "106": 1, "67": 1, "109": 1, "112": 1, "115": 1, "117": 1, "116": 2, "118": 1, "108": 1, "110": 1, "114": 2, "119": 1, "120": 2, "107": 1, "121": 1, "534": 27, "577": 29, "595": 18, "123": 1, "598": 2, "124": 1, "131": 3, "515": 2, "133": 1, "134": 1, "600": 2, "135": 1, "601": 5, "140": 1, "605": 1, "132": 15, "607": 1, "136": 1, "608": 1, "141": 1, "611": 1, "142": 1, "613": 1, "143": 1, "28": 1, "616": 1, "144": 1, "619": 1, "145": 1, "622": 3, "146": 1, "625": 3, "150": 1, "628": 1, "629": 1, "147": 1, "630": 1, "151": 1, "632": 1, "86": 2, "154": 4, "644": 1, "540": 1, "93": 5, "91": 2, "627": 2, "647": 3, "158": 1, "26": 3, "24": 2, "654": 8, "128": 4, "126": 2, "642": 2, "5": 1, "594": 1, "163": 1, "166": 1, "167": 1, "526": 1, "170": 2, "171": 2, "168": 2, "172": 2, "590": 2, "173": 2, "667": 3, "174": 2, "10": 3, "556": 1, "671": 1, "555": 7, "680": 1, "521": 1, "175": 1, "597": 1, "177": 2, "516": 3, "179": 1, "517": 1, "180": 1, "122": 1, "59": 1, "684": 1, "104": 1, "685": 1, "69": 1, "686": 1, "169": 1, "687": 1, "181": 1, "688": 1, "182": 1, "689": 1, "183": 4, "185": 25, "190": 24, "196": 10, "159": 9, "153": 21, "199": 50, "87": 57, "92": 59, "25": 22, "30": 32, "127": 32, "207": 30, "214": 12, "219": 9, "224": 9, "162": 4, "227": 1, "165": 5, "229": 1, "527": 1, "230": 1, "691": 8, "231": 1, "693": 1, "232": 1, "694": 1, "602": 2, "538": 2, "636": 1, "634": 2, "549": 1, "657": 1, "664": 1, "665": 1, "550": 2, "589": 4, "673": 2, "695": 1, "697": 5, "578": 3, "580": 1, "640": 1, "699": 2, "700": 2, "701": 1, "702": 1, "703": 1, "709": 1, "710": 1, "711": 5, "712": 1, "713": 5, "714": 1, "715": 1, "716": 4, "717": 1, "220": 2, "17": 2, "718": 1, "71": 50, "96": 2, "233": 2, "720": 1, "239": 1, "719": 1, "33": 2, "40": 2, "651": 4, "721": 1, "530": 3, "659": 3, "241": 1, "726": 1, "94": 2, "80": 2, "242": 1, "727": 1, "244": 1, "202": 1, "728": 1, "43": 15, "247": 1, "201": 1, "249": 1, "157": 10, "204": 14, "84": 12, "148": 1, "732": 1, "252": 1, "733": 1, "660": 1, "559": 4, "533": 11, "254": 1, "253": 1, "734": 3, "78": 50, "678": 1, "561": 20, "238": 1, "682": 3, "650": 20, "14": 2, "240": 1, "205": 2, "255": 1, "661": 19, "149": 1, "723": 10, "81": 7, "45": 2, "581": 28, "235": 1, "72": 1, "683": 1, "234": 3, "729": 1, "730": 1, "593": 14, "603": 21, "707": 4, "645": 1, "574": 1, "567": 12, "656": 17, "543": 13, "531": 3, "736": 1, "737": 1, "740": 1, "741": 1, "742": 2, "743": 1, "536": 1, "679": 3, "744": 3, "746": 1, "747": 1, "748": 4, "223": 9, "21": 3, "560": 5, "749": 1, "90": 7, "750": 1, "677": 6, "228": 2, "585": 6, "19": 1, "553": 1, "216": 5, "751": 5, "674": 5, "752": 23, "604": 46, "704": 37, "251": 16, "756": 9, "635": 10, "646": 12, "658": 11, "760": 6, "762": 6, "192": 2, "258": 2, "763": 7, "264": 4, "188": 4, "765": 6, "194": 3, "197": 2, "766": 1, "261": 16, "626": 3, "637": 2, "537": 5, "547": 4, "591": 4, "675": 3, "768": 2, "769": 1, "770": 3, "771": 2, "618": 2, "772": 1, "773": 1, "696": 1, "776": 1, "780": 1, "265": 1, "781": 1, "82": 6, "155": 3, "193": 1, "267": 1, "783": 2, "266": 1, "784": 1, "268": 1, "787": 1, "269": 1, "790": 1, "203": 3, "198": 1, "187": 1, "257": 17, "274": 1, "791": 1, "271": 2, "792": 1, "95": 8, "793": 1, "156": 3, "796": 2, "797": 1, "275": 1, "759": 2, "798": 1, "281": 1, "282": 1, "283": 1, "800": 1, "285": 1, "286": 1, "802": 1, "287": 1, "808": 1, "288": 1, "22": 4, "213": 5, "206": 4, "12": 1, "810": 1, "125": 4, "811": 1, "289": 1, "292": 1, "812": 1, "38": 2, "813": 1, "161": 1, "620": 1, "294": 1, "814": 1, "129": 7, "295": 4, "815": 1, "816": 1, "27": 3, "89": 5, "817": 1, "818": 1, "819": 1, "801": 1, "806": 1, "809": 1, "820": 1, "821": 1, "822": 1, "649": 1, "724": 1, "662": 1, "824": 1, "825": 1, "829": 1, "830": 1, "758": 1, "834": 1, "764": 1, "755": 1, "708": 1, "835": 1, "731": 1, "838": 1, "582": 1, "544": 1, "668": 4, "564": 6, "551": 3, "296": 1, "839": 1, "297": 16, "666": 41, "300": 21, "841": 4, "843": 6, "846": 3, "306": 2, "845": 2, "847": 2, "840": 2, "757": 2, "706": 2, "307": 1, "848": 1, "849": 2, "850": 3, "851": 1, "852": 1, "853": 1, "854": 1, "855": 1, "856": 1, "857": 1, "858": 1, "859": 1, "860": 1, "861": 1, "862": 1, "576": 2, "753": 5, "557": 1, "863": 1, "864": 1, "552": 1, "865": 2, "37": 1, "545": 5, "32": 1, "866": 1, "221": 1, "9": 1, "867": 1, "34": 5, "308": 2, "615": 2, "23": 2, "869": 2, "200": 1, "535": 4, "248": 1, "870": 1, "209": 1, "871": 1, "77": 1, "872": 1, "42": 9, "874": 1, "785": 2, "875": 1, "876": 1, "877": 1, "74": 2, "878": 1, "44": 1, "881": 2, "880": 1, "311": 1, "884": 1, "31": 1, "583": 1, "885": 1, "312": 1, "886": 1, "313": 1, "887": 1, "316": 1, "888": 1, "541": 2, "879": 1, "882": 1, "587": 2, "612": 5, "610": 11, "317": 1, "318": 1, "319": 1, "692": 1, "889": 2, "890": 2, "738": 1, "891": 1, "320": 1, "676": 1, "321": 2, "322": 1, "263": 1, "639": 3, "655": 2, "323": 1, "893": 1, "324": 1, "895": 2, "325": 1, "897": 1, "302": 1, "799": 1, "828": 1, "761": 1, "789": 2, "900": 1, "326": 1, "327": 1, "902": 1, "328": 1, "519": 1, "6": 1, "570": 2, "329": 1, "904": 2, "4": 1, "70": 3, "284": 1, "670": 7, "330": 1, "55": 1, "332": 1, "905": 1, "333": 1, "52": 1, "334": 1, "906": 1, "335": 1, "907": 1, "336": 1, "908": 1, "337": 1, "909": 1, "338": 1, "910": 1, "339": 1, "911": 1, "340": 1, "912": 1, "331": 1, "341": 2, "913": 2, "343": 1, "345": 1, "346": 1, "914": 1, "347": 2, "916": 1, "57": 1, "836": 1, "837": 1, "344": 1, "788": 1, "917": 1, "111": 1, "782": 1, "113": 1, "786": 1, "606": 1, "823": 1, "280": 1, "918": 1, "212": 7, "919": 2, "349": 1, "920": 1, "921": 2, "350": 1, "923": 1, "804": 1, "807": 1, "924": 1, "925": 1, "652": 8, "926": 5, "928": 3, "291": 4, "351": 2, "778": 6, "314": 2, "218": 5, "305": 1, "160": 5, "225": 1, "892": 2, "826": 6, "831": 2, "930": 21, "35": 1, "75": 1, "931": 9, "353": 1, "354": 1, "85": 3, "210": 1, "16": 1, "932": 9, "933": 3, "130": 1, "301": 1, "934": 8, "222": 1, "779": 3, "191": 1, "935": 3, "936": 3, "937": 6, "355": 3, "938": 3, "356": 1, "669": 2, "352": 1, "298": 2, "357": 3, "358": 1, "293": 2, "359": 3, "360": 4, "929": 1, "361": 1, "290": 1, "940": 1, "941": 4, "362": 2, "942": 3, "363": 1, "943": 1, "745": 5, "944": 1, "945": 1, "532": 1, "256": 1, "364": 1, "365": 1, "366": 1, "367": 1, "79": 1, "369": 1, "370": 1, "246": 1, "572": 3, "368": 1, "371": 1, "372": 1, "373": 1, "623": 11, "641": 5, "722": 9, "953": 4, "955": 1, "956": 1, "374": 3, "958": 2, "894": 3, "375": 1, "959": 1, "376": 1, "377": 1, "51": 1, "946": 2, "950": 1, "777": 2, "952": 1, "774": 4, "638": 1, "643": 2, "542": 1, "217": 2, "208": 2, "211": 2, "378": 2, "566": 3, "380": 2, "648": 2, "624": 2, "960": 2, "962": 2, "579": 3, "568": 2, "563": 2, "965": 1, "963": 1, "725": 1, "873": 2, "964": 1, "617": 1, "381": 2, "968": 2, "382": 1, "969": 1, "383": 1, "970": 3, "384": 1, "971": 3, "385": 1, "967": 3, "386": 1, "972": 1, "387": 1, "974": 1, "388": 1, "975": 1, "389": 1, "976": 2, "390": 1, "391": 1, "977": 1, "393": 2, "396": 1, "927": 6, "397": 1, "398": 1, "186": 1, "957": 1, "399": 1, "844": 1, "250": 1, "262": 1, "832": 1, "400": 1, "259": 1, "304": 3, "401": 3, "303": 2, "402": 1, "403": 2, "404": 1, "966": 1, "973": 1, "883": 1, "978": 1, "663": 2, "980": 1, "981": 1, "947": 1, "903": 4, "982": 3, "983": 3, "984": 1, "985": 1, "986": 4, "987": 1, "988": 2, "989": 2, "990": 1, "991": 1, "992": 1, "993": 1, "994": 2, "995": 2, "996": 1, "997": 1, "998": 2, "999": 1, "348": 4, "279": 3, "405": 3, "406": 3, "408": 2, "411": 2, "413": 1, "412": 2, "178": 1, "1000": 1, "410": 1, "63": 2, "61": 2, "409": 1, "414": 1, "407": 1, "226": 1, "698": 1, "236": 2, "524": 2, "415": 1, "416": 1, "1002": 2, "418": 1, "1001": 1, "419": 2, "1003": 1, "420": 1, "1004": 1, "421": 1, "422": 1, "599": 1, "423": 1, "424": 1, "518": 1, "425": 2, "426": 1, "427": 1, "428": 1, "948": 2, "429": 1, "1005": 1, "430": 1, "431": 1, "621": 1, "432": 1, "433": 1, "775": 1, "434": 1, "435": 1, "436": 1, "437": 1, "690": 2, "438": 1, "439": 1, "440": 1, "441": 1, "442": 1, "237": 2, "443": 1, "1006": 1, "1007": 1, "444": 1, "1008": 1, "447": 1, "1009": 2, "448": 1, "449": 1, "1010": 1, "1012": 1, "450": 1, "1011": 1, "451": 1, "1013": 1, "575": 2, "243": 1, "1014": 1, "273": 1, "1015": 1, "245": 1, "452": 1, "1016": 1, "417": 1, "1017": 1, "453": 1, "1018": 1, "454": 1, "1019": 1, "137": 1, "1020": 1, "457": 1, "458": 1, "1022": 3, "459": 1, "1021": 1, "460": 1, "1023": 1, "195": 1, "1025": 1, "631": 2, "54": 2, "1026": 1, "278": 1, "139": 3, "461": 1, "1027": 1, "462": 1, "1028": 2, "463": 1, "1029": 1, "464": 1, "1030": 2, "465": 1, "138": 1, "466": 1, "979": 1, "467": 1, "468": 1, "681": 1, "469": 1, "522": 1, "176": 1, "470": 1, "1031": 1, "1032": 1, "1033": 1, "1034": 1, "1035": 1, "1036": 1, "596": 1, "1037": 1, "1024": 1, "1038": 1, "1039": 1, "899": 1, "379": 1, "1040": 1, "471": 1, "1041": 1, "472": 2, "901": 1, "922": 1, "474": 1, "868": 1, "475": 1, "1042": 1, "476": 2, "803": 2, "739": 1, "477": 1, "1043": 1, "478": 1, "805": 1, "479": 1, "480": 1, "1044": 1, "481": 1, "565": 2, "754": 1, "482": 1, "483": 1, "939": 1, "342": 1, "1045": 1, "484": 1, "1046": 1, "485": 1, "1047": 1, "486": 1, "949": 2, "184": 1, "1048": 1, "487": 1, "1050": 1, "488": 1, "1052": 2, "489": 2, "1049": 1, "299": 2, "896": 1, "490": 1, "1053": 1, "491": 1, "1054": 1, "492": 2, "898": 1, "152": 1, "794": 2, "1055": 1, "915": 1, "493": 1, "795": 1, "494": 1, "495": 1, "1056": 1, "496": 1, "705": 1, "497": 1, "842": 1, "1051": 1, "498": 1, "260": 1, "633": 1, "827": 1, "499": 1, "1057": 1, "500": 1, "1058": 1, "501": 1, "502": 1, "1059": 1, "270": 2, "961": 3, "503": 1, "504": 2, "272": 1, "1060": 3, "505": 1, "506": 1, "276": 2, "392": 2, "277": 1, "394": 1, "1061": 1, "507": 1, "395": 1, "309": 1, "1062": 1, "456": 1, "455": 1, "315": 1, "310": 1, "508": 1, "509": 1, "510": 1, "511": 1, "164": 1, "512": 1, "215": 1, "672": 1, "653": 1, "189": 1, "833": 1, "954": 1, "445": 1, "614": 1, "473": 1, "446": 1, "767": 1, "1063": 1, "1064": 1, "951": 1, "1065": 1, "1066": 1, "609": 1, "1067": 1, "1068": 1, "1069": 1, "735": 1}